In [1]:
!ls

1_คำนำหน้า.xls
2_ศาสนา.xls
3_สัญชาติ.xls
4_อาชีพ.xls
5_ประเภทผู้ป่วย.xls
6_ประเภทการรับเข้าผู้ป่วย.xls
7_สิทธิการรักษา.xls
8_เหตุผลการจำหน่ายคนไข้ออก.xls
import data from master.ipynb
venv

In [12]:
from sqlalchemy import create_engine

In [15]:
engine = create_engine("mysql+pymysql://web_user:1234@localhost/smart-dental?charset=utf8mb4")

In [2]:
import pandas

# import title to sql

In [5]:
titles = pandas.read_excel('./1_คำนำหน้า.xls')

In [6]:
titles.head()

   No.  Code English Name Thai Name
0    1     1          Mr.       นาย
1    2     2         Mrs.       นาง
2    3     3         Miss    นางสาว
3    4     4       Master   เด็กชาย
4    5     5         Miss  เด็กหญิง

In [9]:
titles.set_index('No.',inplace=True)

In [10]:
titles

     Code              English Name              Thai Name
No.
1       1                       Mr.                    นาย
2       2                      Mrs.                    นาง
3       3                      Miss                 นางสาว
4       4                    Master                เด็กชาย
5       5                      Miss               เด็กหญิง
..    ...                       ...                    ...
579   579  Professor Medical Docter  ศาสตราจารย์ แพทย์หญิง
580   580                       NaN   พระครูสถิตปริยัติกิจ
581   581                   Pol.Lt.  ว่าที่ร้อยตำรวจโทหญิง
582   582                       NaN      พระราชวชิรญาณโสภณ
583   999                  ไม่ระบุ.                ไม่ระบุ

[583 rows x 3 columns]

In [24]:
titles = titles.rename(columns={"No.":"id", "Code":"code", "English Name": "engName", "Thai Name":"thaiName"})

In [25]:
titles.to_sql('title',con=engine,index_label="id")

# import religious

In [22]:
religious = pandas.read_excel('2_ศาสนา.xls')

In [23]:
religious.head()

   No.  Code English Name Thai Name
0    1     1     Buddhist      พุทธ
1    2     2    Christian    คริสต์
2    3     3        Islam    อิสลาม
3    4     4        Hindu     ฮินดู
4    5     5      Brahman   พราหมณ์

In [28]:
religious = religious.set_index('No.')

In [30]:
religious = religious.rename(columns={"No.":'id',"Code":'code','English Name':'engName','Thai Name':'thaiName'})

In [31]:
religious.to_sql('religion',con=engine,index_label='id')

# import nationality

In [56]:
nationality = pandas.read_excel('3_สัญชาติ.xls')

In [57]:
nationality.head()

   No.  Code English Name                      Thai Name    DRG
0    1    20       GREECE                           กรีก   20.0
1    2    20          NaN                           กรีก   20.0
2    3    71          NaN                      กะเหรี่ยง   71.0
3    4   259          NaN   กะเหรี่ยง(ชุมชนบนพื้นที่สูง)  259.0
4    5   254          NaN  กะเหรี่ยง(ผู้หลบหนีเข้าเมือง)  254.0

In [58]:
nationality = nationality.rename(columns={'No.':'no','Code':'code','English Name':'engName','Thai Name':'thaiName'})

In [61]:
nationality.head()

   no  code engName                       thaiName    DRG
0   1    20  GREECE                           กรีก   20.0
1   2    20     NaN                           กรีก   20.0
2   3    71     NaN                      กะเหรี่ยง   71.0
3   4   259     NaN   กะเหรี่ยง(ชุมชนบนพื้นที่สูง)  259.0
4   5   254     NaN  กะเหรี่ยง(ผู้หลบหนีเข้าเมือง)  254.0

In [64]:
nationality.to_sql('nationality',con=engine,index_label='id')

# import occupation

In [65]:
occupation = pandas.read_excel('4_อาชีพ.xls')

In [66]:
occupation.head()

   CODE English Name           Thai Name
0     0          NaN                 (-)
1   101          NaN             สถาปนิก
2   102          NaN              วิศวกร
3   103          NaN            นักสำรวจ
4   104          NaN  ช่างเทคนิควิศวกรรม

In [68]:
occupation = occupation.rename(columns={'CODE':'code','English Name':'engName', 'Thai Name':'thaiName'})

In [69]:
occupation.head()

   code engName            thaiName
0     0     NaN                 (-)
1   101     NaN             สถาปนิก
2   102     NaN              วิศวกร
3   103     NaN            นักสำรวจ
4   104     NaN  ช่างเทคนิควิศวกรรม

In [70]:
occupation.to_sql('occupation2',con=engine,index_label='id')

# patient type

In [71]:
patientType= pandas.read_excel("5_ประเภทผู้ป่วย.xls")

In [72]:
patientType.head()

   No. Code  English Name                                          Thai Name
0    1   01           NaN                                      ผู้ป่วยทั่วไป
1    2   02           NaN                                        ประกันสังคม
2    3  024           NaN  โครงการวิจัย "เรื่องความสัมพันธ์ระหว่างเสถียรภ...
3    4  025           NaN  โครงการวิจัย "ผลทางคลินิก ความสวยงาม และความเท...
4    5   03           NaN                      ประกันสุขภาพถ้วนหน้า(บัตรทอง)

In [74]:
patientType = patientType.rename(columns={'No.':'no.','Code':'code','English Name':'engName','Thai Name':'thaiName'})

In [75]:
patientType.to_sql('patientType',con=engine,index_label='id')

# Refer Type

In [76]:
referType = pandas.read_excel('6_ประเภทการรับเข้าผู้ป่วย.xls')

In [77]:
referType.head()

   No. Code  English Name                        Thai Name
0    1   01       By Walk                      มาเอง(เดิน)
1    2   02      Accident                       อุบัติเหตุ
2    3   03  By Wheelchai                           รถนั่ง
3    4   04  By Stretcher                           เปลนอน
4    5   05           NaN  นัดตรวจสุขภาพเจ้าหน้าที่ประจำปี

In [79]:
referType = referType.rename(columns={'No.':'no.','Code':'code','English Name':'engName','Thai Name':'thaiName'})

In [81]:
referType

     no. code       engName                         thaiName
0      1   01       By Walk                      มาเอง(เดิน)
1      2   02      Accident                       อุบัติเหตุ
2      3   03  By Wheelchai                           รถนั่ง
3      4   04  By Stretcher                           เปลนอน
4      5   05           NaN  นัดตรวจสุขภาพเจ้าหน้าที่ประจำปี
..   ...  ...           ...                              ...
152  153   O6           NaN           ผ่าตัด GA ในเวลาราชการ
153  154   O7           NaN          ผ่าตัด GA นอกเวลาราชการ
154  155   O8           NaN    ผ่าตัด IV sedate ในเวลาราชการ
155  156   O9           NaN   ผ่าตัด IV sedate นอกเวลาราชการ
156  157   OT    Extra Otho                              NaN

[157 rows x 4 columns]

In [82]:
referType.to_sql('referType',con=engine,index_label='id')

# Treatment right

In [83]:
treatmentRight = pandas.read_excel('7_สิทธิการรักษา.xls')

In [84]:
treatmentRight.head()

   No.  Code  English Name                                    Thai Name
0    1  0101           NaN                                ผู้ป่วยทั่วไป
1    2  0102           NaN              บุคลากรในสังกัดคณะทันแพทยศาสตร์
2    3  0103           NaN         สมาชิกสมาคมศิษย์เก่ามหาวิทยาลัยมหิดล
3    4  0104           NaN    ผู้มีอุปการคุณของคณะทันตแพทย์ ประเภทสามัญ
4    5  0105           NaN  ผู้มีอุปการคุณของคณะทันตแพทย์ ประเภทวิสามัญ

In [86]:
treatmentRight= treatmentRight.rename(columns={'No.':'no.', 'Code':'code','English Name':'engName','Thai Name':'thaiName'})

In [87]:
treatmentRight.to_sql('treatmentRight', con=engine,index_label='id')

# Dismiss Reason

In [ ]:
dismissReason = pandas.read_excel('8_เหตุผลการจำหน่ายคนไข้ออก.xls')